motrice_final_0/Allrun_mio
surfaceFeatureExtract

blockMesh

decomposePar


mpirun -np 4 snappyHexMesh -overwrite -parallel

reconstructParMesh -constant

rm -r pro*

cp -r 0.orig/ 0

decomposePar

mpirun -np 4 simpleFoam -parallel

reconstructPar



#------------------------------------------------------------------------------
