motrice_final_0/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync false;
// Patches to create.
patches
(
   {   
        
        name    Back;

        patchInfo
        {   
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        // patches (periodic1);

        // If constructFrom = set : name of faceSet
        set BackFaces;
    }
    {   
        
        name    Front;

        patchInfo
        {   
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        // patches (periodic1);

        // If constructFrom = set : name of faceSet
        set FrontFaces;
    }
    {   
      
        name    Upper;

        patchInfo
        {   
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        // patches (periodic1);

        // If constructFrom = set : name of faceSet
        set UpperFaces;
    }
  {   
        
        name    Lower;

        patchInfo
        {   
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        // patches (periodic1);

        // If constructFrom = set : name of faceSet
        set LowerFaces;
    }


);
// ************************************************************************* //
