motrice_final_0/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces1
{
    type            forces;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (train);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         1;
    lRef            0.434;        // Wheelbase length
    Aref            0.00895;        // Estimated
}


binField1
{
    type                    binField;
    libs                    (fieldFunctionObjects);
    binModel                singleDirectionUniformBin;
    fields                  (force);
    patches                 (train);
    decomposePatchValues    true;
    CofR                    ${../forces1/CofR};

    binData
    {
        nBin        100;          // output data into 100 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    writeControl            timeStep;
}



// ************************************************************************* //
